In [7]:
# !pip install psycopg2
# !pip install ipython-sql
import psycopg2
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [8]:
DB_USER ="postgres"
DB_PASSWORD = "123456"
DB_NAME="dvdrental"
DB_PORT ="localhost"
# postgresql://username:password@host:port/database
conn_string="postgresql://{}:{}@{}/{}"\
                            .format(DB_USER, DB_PASSWORD, DB_PORT, DB_NAME)

In [9]:
%sql $conn_string

# STEP2: Explore the 3NF Schema

### 2.1 How much? What data sizes are we looking at?

In [10]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

In [11]:
print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 14596
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry	= 109

### 2.2 When? What time period are we talking about?

In [12]:
%%sql
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

### 2.3 Where? Where do events in this databse occur?

In [13]:
%%sql
select district, sum(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

# STEP3: Perform some simple data analysis

## 3.1 Insight 1: Top Grossing Movies
- Payments amounts are in table payment
- Movies are in table film
- They are not directly linked, payment refers to a rental, rental refers to an inventory item and inventory item refers to a film
- payment → rental → inventory → film

In [14]:
%%sql
SELECT title, sum(p.amount) as revenue             
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
group by title
order by revenue desc
limit 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Telegraph Voyage', Decimal('215.75')),
 ('Zorro Ark', Decimal('199.72')),
 ('Wife Turn', Decimal('198.73')),
 ('Innocent Usual', Decimal('191.74')),
 ('Hustler Party', Decimal('190.78')),
 ('Saturday Lambs', Decimal('190.74')),
 ('Titans Jerk', Decimal('186.73')),
 ('Harry Idaho', Decimal('177.73')),
 ('Torque Bound', Decimal('169.76')),
 ('Dogma Family', Decimal('168.72'))]

## 3.2 Insight 2: Top grossing cities
- Payments amounts are tin table payment
- Cities are table cities
- payment -> customer -> address -> city

In [15]:
%%sql
SELECT city.city, sum(p.amount) as amount
FROM payment as p
JOIN customer as c
ON p.customer_id = c.customer_id
JOIN address as a
ON a.address_id = c.address_id
JOIN city
ON city.city_id = a.city_id
GROUP BY city
ORDER BY amount DESC
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Saint-Denis', Decimal('211.55')),
 ('Cape Coral', Decimal('208.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('191.62')),
 ('Molodetno', Decimal('189.60')),
 ('Qomsheh', Decimal('183.63')),
 ('London', Decimal('174.54')),
 ('Memphis', Decimal('167.67')),
 ('Richmond Hill', Decimal('167.62')),
 ('Tanza', Decimal('166.61'))]

## 3.3 Insight 3: Revenue of a movie by customer city and by month

In [16]:
%%sql
SELECT film.title,city.city, sum(payment.amount) AS revenue, 
extract(MONTH FROM payment.payment_date) as month
FROM payment
JOIN customer
ON customer.customer_id = payment.customer_id
JOIN address
ON customer.address_id = address.address_id
JOIN city 
ON address.city_id = city.city_id
JOIN rental
ON payment.rental_id = rental.rental_id
JOIN inventory
ON inventory.inventory_id = rental.inventory_id
JOIN film
ON film.film_id = inventory.film_id
GROUP BY film.title, city.city, payment.payment_date
ORDER BY month, revenue DESC
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Doors President', 'Zhoushan', Decimal('10.99'), Decimal('2')),
 ('Mine Titans', 'Plock', Decimal('10.99'), Decimal('2')),
 ('Autumn Crow', 'Stockport', Decimal('10.99'), Decimal('2')),
 ('Behavior Runaway', 'Battambang', Decimal('10.99'), Decimal('2')),
 ('Telegraph Voyage', 'Pangkal Pinang', Decimal('10.99'), Decimal('2')),
 ('Tycoon Gathering', 'So Bernardo do Campo', Decimal('10.99'), Decimal('2')),
 ('Satisfaction Confidential', 'Suihua', Decimal('10.99'), Decimal('2')),
 ('Flintstones Happiness', 'Alessandria', Decimal('10.99'), Decimal('2')),
 ('Stranger Strangers', 'Czestochowa', Decimal('10.99'), Decimal('2')),
 ('Trap Guys', 'Tangail', Decimal('10.99'), Decimal('2'))]

# STEP4: Creating fact and dimensions

### Creating the first dimension table

ToDo: Create a dimDate dimension table with the fields and data types shown in the ERD above

In [17]:
%%sql
CREATE TABLE dimDate(
    date_key INTEGER NOT NULL PRIMARY KEY,
    date DATE NOT NULL,
    year SMALLINT NOT NULL,
    quarter SMALLINT NOT NULL,
    month SMALLINT NOT NULL,
    day SMALLINT NOT NULL,
    week SMALLINT NOT NULL,
    is_weekend BOOLEAN
)

 * postgresql://postgres:***@localhost/dvdrental
Done.

[]

In [18]:
%%sql
SELECT COLUMN_NAME, DATA_TYPE 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'dimdate'

 * postgresql://postgres:***@localhost/dvdrental
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

In [19]:
%%sql
CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

 * postgresql://postgres:***@localhost/dvdrental
Done.
Done.
Done.

[]

### Create the fact table

In [20]:
%%sql
CREATE TABLE factSales
(
    sales_key SERIAL PRIMARY KEY,
    date_key INTEGER REFERENCES dimdate (date_key), 
    customer_key INTEGER REFERENCES dimcustomer (customer_key),
    movie_key INTEGER REFERENCES dimmovie (movie_key),
    store_key INTEGER REFERENCES dimstore (store_key),
    sales_amount FLOAT NOT NULL
);

 * postgresql://postgres:***@localhost/dvdrental
Done.

[]

In [21]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'factsales'

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[('sales_key', 'integer'),
 ('date_key', 'integer'),
 ('customer_key', 'integer'),
 ('movie_key', 'integer'),
 ('store_key', 'integer'),
 ('sales_amount', 'double precision')]

# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

### Insert into dimdate

In [22]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://postgres:***@localhost/dvdrental
32 rows affected.

[]

Check result

In [23]:
%%sql
SELECT * FROM dimdate
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(20070323, datetime.date(2007, 3, 23), 2007, 1, 3, 23, 12, False),
 (20070318, datetime.date(2007, 3, 18), 2007, 1, 3, 18, 11, True),
 (20070430, datetime.date(2007, 4, 30), 2007, 2, 4, 30, 18, False),
 (20070410, datetime.date(2007, 4, 10), 2007, 2, 4, 10, 15, False),
 (20070316, datetime.date(2007, 3, 16), 2007, 1, 3, 16, 11, False)]

#### Populate the dimCustomer table with data from the customer, address, city, and country tables